notify_files/Notify.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
              xmlns:enc="http://www.w3.org/2003/05/soap-encoding"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:rpc="http://www.w3.org/2003/05/soap-rpc"
              xmlns:xop="http://www.w3.org/2004/08/xop/include"
              xmlns:wsa="http://www.w3.org/2005/08/addressing"
              xmlns:tt="http://www.onvif.org/ver10/schema"
              xmlns:tns1="http://www.onvif.org/ver10/topics"
              xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
              xmlns:wstop="http://docs.oasis-open.org/wsn/t-1">
    <SOAP-ENV:Header>
        <wsa:Action SOAP-ENV:mustUnderstand="1">http://docs.oasis-open.org/wsn/bw-2/NotificationConsumer/Notify</wsa:Action>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic Dialect="http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet">%TOPIC%</wsnt:Topic>
                <wsnt:Message>
                    <tt:Message UtcTime="%UTC_TIME%" PropertyOperation="%PROPERTY%">
                        <tt:Source>
                            <tt:SimpleItem Name="%SOURCE_NAME%" Value="%SOURCE_VALUE%"/>
                        </tt:Source>
                        <tt:Data>
                            <tt:SimpleItem Name="State" Value="%VALUE%"/>
                        </tt:Data>
                    </tt:Message>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
